app/views/users/show.html.erb

	<p><%= secret.content %></p>
	<p><%= secret.likes.count %> likes</p>
---
SELECT COUNT(*) FROM "likes"  WHERE "likes"."secret_id" = ?  [["secret_id", 4]]