app/views/secrets/index.html.erb

	<p><%= secret.content %></p>
	<p><%= secret.likes.count %> likes </p>

<% if secret.users_liked.include?(current_user) %>
---
SELECT COUNT(*) FROM "likes"  WHERE "likes"."secret_id" = ?  [["secret_id", 3]]
SELECT  1 AS one FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."secret_id" = ? AND "users"."id" = 3 LIMIT 1  [["secret_id", 6]]
SELECT "likes"."id" FROM "likes"  WHERE "likes"."user_id" = 3 AND "likes"."secret_id" = 7