app/controllers/likes_controller.rb

	def create
		like = Like.new(user:current_user, secret:Secret.find(params[:secret_id]))
		if like.save
---
SELECT  "secrets".* FROM "secrets"  WHERE "secrets"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "likes" ("created_at", "secret_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2016-01-18 01:28:11.743524"], ["secret_id", 3], ["updated_at", "2016-01-18 01:28:11.743524"], ["user_id", 3]]

	def destroy
		like = Like.find(params[:id])
		if like.destroy
---
SELECT  "likes".* FROM "likes"  WHERE "likes"."id" = ? LIMIT 1  [["id", 16]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]