app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets"
---
	def index
		@secrets = Secret.all

INSERT INTO "secrets" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "hi"], ["created_at", "2016-01-16 00:04:58.921310"], ["updated_at", "2016-01-16 00:04:58.921310"], ["user_id", 2]]
---
	def create
		secret = Secret.new(secret_params)
		if secret.save

SELECT  "secrets".* FROM "secrets"  WHERE "secrets"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "secrets" WHERE "secrets"."id" = ?  [["id", 1]]
---
	def destroy
		secret = Secret.find(params[:id])
		secret.destroy if secret.user == current_user