app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @secrets = User.find(params[:id]).secrets
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "secrets".* FROM "secrets"  WHERE "secrets"."user_id" = ?  [["user_id", 1]]

  def create
  	u = User.new(user_params)
    session[:user_id] = u.id
  	if u.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
  	u = User.find(params[:id])
  	if u.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["name", "Jessica"], ["password_digest", "$2a$10$9ywBK5No645bPFH4VHvUP.jj9xL0Qjhl.ONWpQlXL1Ob0NV788UoC"], ["updated_at", "2016-01-17 23:45:13.201516"]]